import image1 from '../assets/images-news/1.jpg'
import image2 from '../assets/images-news/2.webp'

// eslint-disable-next-line @typescript-eslint/no-explicit-any
export const news: any = [
    {
        id: 1,
        image: image1,
        title: 'Летнее изобилие зимой',
        content: {
            subtitle: 'Как быстро и просто сохранить урожай?',
            text: [
                'Любая хорошая хозяйка думает: чем вкусным и полезным накормить своих  родных и близких? И если летом накрыть стол не составляет труда, - есть  свежие овощи и фрукты по приемлемым ценам, - то зимой, когда холодно и  витамины особенно нужны, цены на свежие овощи становятся  астрономическими и больно бьют по карману. Конечно, можно купить дешевые заводские заготовки, но стоит почитать состав на банке, и думаешь, чего там больше: «красителей, идентичных натуральному», или натуральных  продуктов?',
                'Выход придумали давным-давно: наши мамы и бабушки варили варенье,  солили, мариновали, квасили, сушили… Помните, как в детстве было вкусно  похрустеть соленым огурчиком с черным хлебом? А свой “хренодер” с  пельмешками? А малиновое варенье?! А?! Вспомнили? И все это делали из  того, что вырастили и собрали сами. Своими руками. А потом сами сварили, засолили, замариновали без непонятных красителей и консервантов.  Конечно, если раньше наши бабушки и мамы, рискуя обжечься, доставали  банки из горячей воды, мучились, закатывая, то сейчас эти проблемы  решены.',
                'Мы собрали отличный ассортимент товаров для домашней заготовки, которые  помогут вам без лишних хлопот накормить зимой своих близких вкусными и  полезными домашними соленьями и вареньями.'
            ],
            contentHTML: ''
        },
        link: 'letneye-izobiliye-zimoy'
    },
    {
        id: 2,
        image: image2,
        title: 'Идеальная форма для запекания',
        content: {
            subtitle: 'Как выбрать идельную посуду для выпечки и запекания?',
            text: [
                'Выпечка, мясо, рыба, овощи, запеканки и даже десерты – всё это можно легко приготовить в духовке, если у вас есть подходящие формы. Однако выбор правильной формы для запекания – задача не из простых. На что обратить внимание? Какие материалы подходят для разных блюд? Как ухаживать за формами? Давайте разбираться!',
                'Выбор материала формы – это ключевой момент, так как он влияет на равномерность запекания, удобство использования и долговечность посуды.'
            ],
            contentHTML: ''
        },
        link: 'idealnaya-forma-dlya-zapekaniya'
    },
]