import React from 'react'
import GoodSectionGallery from './GoodSectionGallery'
import Rating from '../Rating'
import { CustomContextMain } from '../../context/MainContext'

const GoodSectionLine = () => {
    const [isMore, setIsMore] = React.useState(false)
    // eslint-disable-next-line @typescript-eslint/no-explicit-any
    const {windowRef}: any = React.useContext(CustomContextMain);
  return (
    <div className='goodSection-line'>
        <div><GoodSectionGallery /></div>
    <div className='goodSection-line-info'>
        <h2>Плита печная цельная</h2>
        <div className='goodSection-rating'>
            <Rating rating={5} />
            <p>4,8</p>
        </div>
        <h1>1413 ₽</h1>
        <div className='goodSection-character'>
            <p>Артикул:</p>
            <p>80164116</p>
        </div>
        <div className='goodSection-character'>
            <p>Материал изделия:</p>
            <p>чугун</p>
        </div>
        <div className='goodSection-description'>
            <p><b>Описание:</b> Колосник - это элемент гарнитуры топки, необходимая составляющая любой печи. Решетка для печи выполнена из жаропрочного литейного чугуна и предназначена для поддержания слоя твердого горящего топлива в топке и подвода воздуха в слой топлива через отверстия - прозоры. Колосник также выполняет функцию отвода золы из топочной камеры в зольник. Материал устойчив к повреждениям, деформации, не окисляется при взаимодействии с воздухом.</p>
        </div>
        <div className='goodSection-exchange'>
                <div>
                    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="currentColor"><path d="M4.00488 5.00275V19.0027H20.0049V5.00275H4.00488ZM3.00488 3.00275H21.0049C21.5572 3.00275 22.0049 3.45046 22.0049 4.00275V20.0027C22.0049 20.555 21.5572 21.0027 21.0049 21.0027H3.00488C2.4526 21.0027 2.00488 20.555 2.00488 20.0027V4.00275C2.00488 3.45046 2.4526 3.00275 3.00488 3.00275ZM15.0049 7.00275L18.5049 10.0027L15.0049 13.0027V11.0027H11.0049V9.00275H15.0049V7.00275ZM9.00488 17.0027L5.50488 14.0027L9.00488 11.0027V13.0027H13.0049V15.0027H9.00488V17.0027Z"></path></svg>
                </div>
                <p>Обмен и возврат 10 дней</p>
        </div>
        <div className='cartGood-category'>
                <p>Аксессуары для бани</p>
                <div >
                    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="currentColor"><path d="M16.1716 10.9999L10.8076 5.63589L12.2218 4.22168L20 11.9999L12.2218 19.778L10.8076 18.3638L16.1716 12.9999H4V10.9999H16.1716Z"></path></svg>
                </div>
        </div>
    </div>
        <div className='goodSection-more' onClick={() => setIsMore(!isMore)}>
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="currentColor"><path d="M12 3C10.9 3 10 3.9 10 5C10 6.1 10.9 7 12 7C13.1 7 14 6.1 14 5C14 3.9 13.1 3 12 3ZM12 17C10.9 17 10 17.9 10 19C10 20.1 10.9 21 12 21C13.1 21 14 20.1 14 19C14 17.9 13.1 17 12 17ZM12 10C10.9 10 10 10.9 10 12C10 13.1 10.9 14 12 14C13.1 14 14 13.1 14 12C14 10.9 13.1 10 12 10Z"></path></svg>
        </div>
    
       <div className='goodSection-line-actions' 
       style={{transform: windowRef.current <= 500 ? isMore ? 'scale(1)' : 'scale(0)' : 'scale(1)'}}
       >
            <div>
                <svg viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M1.66699 10.0003H3.33366V17.5003H1.66699V10.0003ZM4.16699 11.667H5.83366V17.5003H4.16699V11.667ZM13.3337 6.66699H15.0003V17.5003H13.3337V6.66699ZM15.8337 8.33366H17.5003V17.5003H15.8337V8.33366ZM7.50033 1.66699H9.16699V17.5003H7.50033V1.66699ZM10.0003 3.33366H11.667V17.5003H10.0003V3.33366Z" fill="#565656"/>
                </svg>
            </div>
            <div>
                <svg viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M3.33697 5.34751L0.634766 2.64531L1.81327 1.4668L4.51547 4.169H17.2169C17.6772 4.169 18.0502 4.5421 18.0502 5.00233C18.0502 5.08343 18.0384 5.16411 18.0152 5.24179L16.0152 11.9085C15.9094 12.261 15.5849 12.5024 15.2169 12.5024H5.00363V14.169H14.1703V15.8357H4.1703C3.71006 15.8357 3.33697 15.4625 3.33697 15.0024V5.34751ZM5.00363 5.83566V10.8357H14.5969L16.0969 5.83566H5.00363ZM4.58697 19.169C3.89661 19.169 3.33697 18.6094 3.33697 17.919C3.33697 17.2286 3.89661 16.669 4.58697 16.669C5.27733 16.669 5.83697 17.2286 5.83697 17.919C5.83697 18.6094 5.27733 19.169 4.58697 19.169ZM14.587 19.169C13.8966 19.169 13.337 18.6094 13.337 17.919C13.337 17.2286 13.8966 16.669 14.587 16.669C15.2773 16.669 15.837 17.2286 15.837 17.919C15.837 18.6094 15.2773 19.169 14.587 19.169Z" fill="#565656"/>
                </svg>
            </div>
            <div>
                <svg viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M3.33366 6.66699H16.667V17.5003C16.667 17.9606 16.2939 18.3337 15.8337 18.3337H4.16699C3.70676 18.3337 3.33366 17.9606 3.33366 17.5003V6.66699ZM5.00033 8.33366V16.667H15.0003V8.33366H5.00033ZM7.50033 10.0003H9.16699V15.0003H7.50033V10.0003ZM10.8337 10.0003H12.5003V15.0003H10.8337V10.0003ZM5.83366 4.16699V2.50033C5.83366 2.04009 6.20676 1.66699 6.66699 1.66699H13.3337C13.7939 1.66699 14.167 2.04009 14.167 2.50033V4.16699H18.3337V5.83366H1.66699V4.16699H5.83366ZM7.50033 3.33366V4.16699H12.5003V3.33366H7.50033Z" fill="#565656"/>
                </svg>
            </div>
        </div>
        
        
    
</div>
  )
}

export default GoodSectionLine